Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: ཚུལ་ཁྲིམས་བསམ་གཏན་རྣམ་ཐར་རྣམས། །མདོར་བསྡུས་འདི་ཡིས་ཐོབ་པ་སྟེ། །
en: “In brief, this attainment will come To those with discipline, meditation, and [the three] liberations,

source: དོན་ཀུན་སྒྲུབ་བྱེད་གྲུབ་པ་སྟེ། །རྒྱལ་བ་མཆོག་གིས་གསུངས་པ་ཡིན། །
en: And it will fulfill for them all aims— This has been taught by the chief among the victors. {11.262}

source: ནོར་རྣམས་རྒྱས་པར་འཐོབ་འགྱུར་ཏེ། །དམ་པའི་འགྲོ་བར་གནས་པ་དང་། །
en: “One will obtain an increase in riches, Reside in the ultimate realm,

source: དེ་བཞིན་རྟག་ཏུ་གནོད་སྦྱིན་སྤྱན། །ལྷ་མིའི་རྒྱལ་སྲིད་བྱེད་པར་འགྱུར། །
en: Or be the leader, in any event, of the yakṣa s And the sovereign of gods and men. {11.263}

source: མི་ལྷ་ལྷ་མིན་འཇིག་རྟེན་གྱི། །དེ་བཞིན་བདག་པོ་ཐོབ་འགྱུར་ཏེ། །བདག་པོ་མ་ལུས་དེ་དག་གི། །སྔགས་པས་ཐམས་ཅད་འཐོབ་པ་དང་། །འབྲས་བཅས་བྱ་བ་བྱེད་པར་འགྱུར། །
en: “One who [knows] all mantras Will obtain supremacy Over men , gods, and asuras, And will make his rites bear fruit. {11.264}

source: གཙང་སྦྲའི་སྤྱོད་དང་ལྡན་པ་དང་། །ཚུལ་ཁྲིམས་བསམ་གཏན་རྟག་ཏུ་དགའ། །
en: “One should always practice pure conduct And take joy in discipline and meditation.

source: རྒྱུད་རྣམས་ཀུན་ལས་གསུངས་པ་ཡི། །སྔགས་པས་བཟླས་པ་རྟག་ཏུ་བྱ། །
en: A mantra practitioner should recite the mantra That has been taught in all the tantras. {11.265}

source: སྔགས་པ་འབྱོར་པ་འདོད་པ་ཡིས། །ལས་རྣམས་སྣ་ཚོགས་བྱ་བ་སྟེ། །
en: “The mantra practitioner may perform the various types of rites, Such as those of the highest or middling type.

source: དེ་བཞིན་མཆོག་དང་བར་མ་དང་། །ཐ་མ་ཉིད་ཀྱང་བྱ་བ་ཡིན། །
en: If, however, he desires riches, He should perform those of the lowest type. {11.266}

source: ཐ་མས་ལོངས་སྤྱོད་འཕེལ་པའི་གནས། །
en: “The lowest rites will bring an increase of pleasures;

source: འབྲིང་གིས་གོང་མའི་ལུས་ཐོབ་ཅིང་། །
en: The middling will bring a superior body.

source: མཆོག་གིས་རབ་ཏུ་འགྲོ་བ་སྟེ། །ཟློས་པས་རྟག་ཏུ་ཐོབ་པར་འགྱུར། །
en: The reciter will, however, attain the highest state Only through the supreme rites. {11.267}

source: སྔགས་པས་ཟློས་མཐར་ངལ་བསོ་ཞིང་། །ཇི་སྲིད་དུས་སུ་བསྡད་པར་བྱ། །
en: “At the end of recitation, the practitioner should rest, For as long as necessary;

source: ཟློས་པས་དུས་ལ་བབ་པ་ན། །དེར་ནི་བསྒྲུབ་པ་བྱ་བ་ཡིན། །
en: He should do his formal practice When the time for it has arrived. {11.268}

source: དེ་ལྟར་མོད་ཀྱི་དེ་ལ་སྔགས་པས་ལས་རྣམས་བསྒྲུབ་པ་ན་དེར་རྟག་ཏུ་བཟླས་ན། སྐྱེས་བུ་རྣམས་ཀྱི་སྡིག་པ་ཟད་པར་བྱེད་ཅིང་།
en: “Even though all his rites have succeeded, the mantra practitioner Should keep reciting in order to exhaust all the evil of human beings.

source: ལས་རྣམ་པ་སྣ་ཚོགས་སྐྱེ་བ་བརྒྱུད་པ་དག་ཏུ་གང་དུ་གང་བྱས་པ་དེ་དག་ལ་གྲུབ་པ་གནས་པར་ནམ་ཞིག་འགྱུར་ཞེ་ན། སྐྱེས་བུས་ཇི་སྲིད་ཚོགས་པ་རྙེད་པ་ན།
en: What is normally done through successive rites, He can accomplish through a single rite performed according to procedure. {11.269} “His accomplishment will become stable When he has acquired all that is possible for human beings to acquire.

source: སྔགས་པའི་ངོ་བོས་སྔགས་བཟླས་པ་ན་སྡིག་པ་ཟད་པའི་དོན་དང་ལས་བསྲབས་པས་སྔགས་འགྲུབ་པར་འགྱུར་ཏེ།
en: Such a mantra reciter should nevertheless continue to recite the mantra In order to exhaust evil, and then, to remove the karma of beings. {11.270}

source: དེ་བཞིན་དུ་མཆོག་དང་བར་མ་དང་ཐ་མ་དང་འཇིག་རྟེན་གྱིས་མཆོད་པ་དང་།
en: “May the mantras revered by the world That are supreme, middling, or inferior be successful!

source: བཟླས་པས་སྡིག་པ་མཐའ་དག་ཟད་པར་བྱེད་ཅིང་། ལུས་ཅན་ཐམས་ཅད་ཀྱི་སྐྱེ་བ་བརྒྱུད་པ་དག་ཏུ་གང་བྱས་པའི་སྡིག་པ་དེ་དག་ཐམས་ཅད་འཇིག་པར་བྱེད་དེ
en: When recited they will exhaust all karma That has been accumulated throughout the succession of births. {11.271} “The evil of all the embodied beings will then be destroyed.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྔགས་བཟླས་ན་ལུས་རྒྱན་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ་ཡིད་དགའ་ཞིང་། ཡོན་ཏན་ཐམས་ཅད་ཀྱིས་གྲགས་པར་འགྱུར་བ་དང་། གནོད་སྦྱིན་གྱི་ཚོགས་ཀྱི་རྒྱལ་པོ་ཉིད་དང་རྟག་ཏུ་དོན་ཐམས་ཅད་ཐོབ་པ་དང་ལྡན་པ་ཡིན་ནོ། །
en: One will obtain various body ornaments, Pleasing to the mind and possessed of all good qualities. One will obtain a place in the Yakṣa, with the permanent position of a king. Those who recite the mantra of the tathāgatas Will obtain every accomplishment.” {11.272}

source: བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཕལ་པོ་ཆེ་ཐེག་པ་ཆེན་པོ་ཤིན་ཏུ་རྒྱས་པའི་མདོ་ལས། འཕགས་པ་འཇམ་དཔལ་གྱི་རྩ་བའི་ཆོ་ག་རབ་འབྱམ་ལས། སྒྲུབ་པའི་ཐབས་ཀྱི་ལས་ཀྱི་གནས་བཞི་པ་ལས་བཟླས་པ་དང་ངེས་པར་སྡོམ་པ་དང་སྦྱིན་སྲེག་དང་བསམ་གཏན་དང་། གཙང་སྦྲའི་སྤྱོད་པ་དང་ལས་ཐམས་ཅད་ཀྱི་ཆོ་ག་སྒྲུབ་པའི་ལེའུ་རབ་འབྱམ་བཅུ་གཅིག་པ་རྫོགས་སོ།། །།
en: This concludes the eleventh chapter of “The Root Manual of Noble Mañjuśrī,” an extensive Mahāyāna sūtra that forms a garland-like basket of bodhisattva teachings. This chapter constitutes the detailed fourth chapter on places suitable for the performance of the ritual; on mantra recitation, ritual observances, homa, meditation, purificatory rites, and conduct; and the performance of all the rites according to procedure.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས་ཐམས་ཅད་དང་ལྡན་པའི་གནས་གཙང་མའི་གཞལ་མེད་ཁང་ལ་གཟིགས་ནས། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ།
en: Now Lord Śākyamuni again looked at the entire Pure Abode, and said this to Mañjuśrī, the divine youth:

source: འཇམ་དཔལ་ཉོན་ཅིག །ཁྱོད་ཀྱི་རིག་པའི་སྔགས་རྗེས་སུ་སྤྱོད་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་ལ་རྗེས་སུ་བརྩོན་པ།
en: “Listen, Mañjuśrī, to [the instructions] for the followers of your vidyā mantra who strive to benefit all beings—

source: སེམས་ཅན་རྣམས་གང་ཟློས་པར་བྱེད་པ་དང་གང་གིས་ཟློས་པར་བྱེད་པ་དང་།
en: what mantras they should be made to recite, by whom these mantras are to be recited,

source: དེའི་ཕྲེང་བའི་ཆོ་ག་དེ་ཐམས་ཅད་རྒྱུད་ཐམས་ཅད་ཀྱི་སྤྱི་སྔགས་ཐམས་ཅད་ཀྱི་སྒྲུབ་པའི་ཐབས་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག །
en: and the attendant rosary rites that are methods for accomplishing all the common mantras of all tantras. Listen carefully and reflect on this well.

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: I will teach this [now].” {12.1}

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At these words, Mañjuśrī, the divine youth, said this to the Blessed One:

source: བཅོམ་ལྡན་འདས་ལེགས་སོ་ལེགས་སོ། །བདག་ལ་ཐུགས་བརྩེ་བའི་དོན་དང་། སྔགས་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་དང་དམ་ཚིག་ལ་ཞུགས་པ་རྣམས་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་སླད་དུ་དེ་བཤད་དུ་གསོལ།
en: “Good! May the Blessed One show us the favor of teaching this for the sake of all those who entered the samaya of mantra practice, as well as every other being.” {12.2}

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: After Mañjuśrī, the divine youth, spoke thus, the Blessed One said this to him:

source: འཇམ་དཔལ་ཉོན་ཅིག །རྣམ་པར་དབྱེ་བ་རྒྱ་ཆེར་བཤད་པར་བྱ་སྟེ། སྔགས་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ལ་མངོན་པར་བརྩོན་པ་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་སྒྲུབ་པར་བྱེད་དེ།
en: “Listen, Mañjuśrī, as I will teach at length and in detail how beings can accomplish all their aims by applying all the mantra conduct. And how [do they do this]?

source: དང་པོར་རེ་ཞིག་སྔགས་སུ་འགྱུར་བ་དེ་གང་ཞེ་ན།
en: First there is [the following] mantra.

source: ན་མཿསརྦ་བུད་དྷཱ་ནཱཾ། ཨ་ཙིན་ཏྱཱད་བུད་དྷ་རཱུ་པཱི་ཎཱཾ། ཏདྱ་ཐཱ།
en: Homage to all the buddhas whose forms are marvelous and inconceivable.

source: ཨོྃ་ཀུ་རུ་ཀུ་རུ། སརྦཱ་རྠཱཾ་སཱ་དྷ་ཡ། སརྦ་དུཥྚཾ་བི་མོ་ཧ་ནི། ག་ག་ནཱ་བི་ལམྤེ་བི་ཤོ་དྷ་ཡ་སྭཱ་ཧཱ།
en: “ Oṁ , act, act! Accomplish all aims, accomplish! O (female) sky dweller who dumbfounds all the wicked ones, effect the purification! Svāhā! {12.3}

source: སྔགས་འདིས་ཕྲེང་བ་ཐམས་ཅད་ལ་ལས་བྱའོ། །
en: “One should employ this mantra in the rites of crafting all types of rosaries,

source: སྦྱང་བ་དང་དགུག་པ་དང་བླང་བ་དང་རྒྱུ་བ་ལ་སོགས་པའི་ལས་བྱའོ། །
en: those that involve cleaning, drilling, threading, separating, and so forth. {12.4}

source: དང་པོ་ཕྲེང་བའི་ཤིང་ལ་ནི། །སྔགས་ཀྱིས་ལན་གྲངས་ཉི་ཤུ་བདུན། །
en: “First, when making a rosary, One should incant the tree Thirty-seven times.

source: མངོན་པར་བསྔགས་པ་བྱས་ནས་ནི། །སྡོམ་བརྩོན་རྟག་ཏུ་བསྲུང་བ་བྱ། །
en: A vow holder should then perform the protection rite. {12.5}

source: མཚན་གཅིག་དེར་ནི་ཉལ་བྱས་ན། །
en: “One should then sleep one night

source: རྨི་ལམ་ནང་དུ་དེས་མཐོང་བ། །མི་མ་ཡིན་གཟུགས་གྲུབ་པ་ནི། །མི་སྡུག་མཆེ་བ་གཙིགས་པའོ། །
en: And in one’s sleep one will see A nonhuman being, either beautiful Or ugly, and baring its teeth.

source: སྔགས་པ་ལ་ནི་དེས་སྨྲས་པ། །ནོར་ནི་ཅི་འདོད་ཁྱེར་ཅིག་ཅེས། །
en: This friendly being will say, ‘Bring me, as is proper, something of value.’ {12.6}

source: སྒྲུབ་བྱེད་ནང་པར་ལངས་ནས་ནི། །ཤིང་དེ་ལས་ནི་འགྲོ་བར་བྱེད། །
en: “The practitioner should then rise early And go to the tree that has been indicated,

source: སྔགས་པས་ཤིང་དེ་བོར་ནས་ནི། །གཞན་དག་ཏུ་ནི་འགྲོ་བྱེད་ན། །མི་སྡུག་གཟུགས་ཅན་འཇིགས་བྱེད་པ། །རྨི་ལམ་དུ་ཡང་མཐོང་མི་འགྱུར། །
en: Unless one saw in one’s dream A tree that is huge and misshapen. {12.7} “One should avoid trees of this kind And go instead to another tree.

source: དང་པོར་རུ་དྲཱ་ཀྵ་ཡིན་ཏེ། །
en: A rudrākṣa tree is the best;

source: ཨིན་དྲཱཀྵ་ནི་གཉིས་པ་ཡིན། །
en: The next best is an arjuna tree, {12.8}

source: ཐ་མ་བོ་དེ་ཙེ་ཡིན་ལ། །
en: “A lucky bean tree,

source: གཞན་ཡང་འབྲས་བུ་ཡོད་པའོ། །
en: or another good tree That bears fruit suitable for beads.

source: ཤིང་ལ་ལེགས་པར་འཛེག་མཁས་པའི། །གྲོགས་དང་ལྷན་ཅིག་འཛེག་པར་བྱ། །
en: One should climb it together with companions Who are good at climbing trees. {12.9}

source: གྲོགས་པོ་མེད་པར་གྱུར་ན་ནི། །རང་ཉིད་དེ་ལ་འཛེག་པར་བྱ། །
en: “If such a mantra reciter has no companions, He should climb by himself.

source: སྟེང་གི་ཡལ་གའི་འབྲས་གནས་སུ། །སྡོམ་བརྩོན་བརྟུལ་ཞུགས་ཅན་འཛེགས་ཏེ། །
en: A lay vow holder should climb to the fruit Located on the uppermost branches. {12.10}

source: རྟག་ཏུ་དེ་ལ་བག་ཡོད་པས། །སྟེང་གི་ཡལ་ག་ལ་བྱུང་ནས། །
en: “Never distracted from his task, He should pick fruits that issue from upper branches.

source: ཡལ་གའི་སྟེང་གི་འབྲས་བླངས་ཏེ། །སྟེང་གི་ལས་ལ་སྦྱར་བར་བྱ། །
en: Having thus obtained fruits from these branches, He should use them in superior rites. {12.11}

source: སྟེང་གི་གྲུབ་པ་མཆོག་ཏུ་ནི། །གང་ཟག་མཆོག་གིས་གསུངས་པ་ཡིན། །
en: “For it has been taught by the best of men That when a rite is superior, the accomplishment will be superior too;

source: བར་མ་བར་མའི་གྲུབ་པ་སྟེ། །
en: When it is middling, the accomplishment will be middling;

source: གྲུབ་པ་ཐ་མའང་ཐ་མའི་ཡིན། །
en: And when it is minor, the accomplishment will be minor. {12.12}

source: རྟག་ཏུ་སྲོག་ཆགས་མ་ཟོས་པའི། །འབྲས་བུ་ཡང་དག་བླང་བར་བྱ། །
en: “If one takes fruit from them, One will never be disliked by sentient beings.

source: ནུབ་ཀྱི་ཡལ་ག་ལས་ཐོབ་པ། །རྫས་ཀྱི་རྒྱུར་ནི་གྲུབ་པ་ཡིན། །
en: If one takes seeds from the western branches, One’s mantras will be effective in the preparation of power substances. {12.13}

source: བྱང་གི་གནོད་སྦྱིན་ལ་སོགས་དང་། །ལྷ་རྣམས་རྟག་ཏུ་འགུགས་པར་བྱེད། །
en: “If the seeds are from the northern branches, One will always be able to summon yakṣa deities or those of similar stock.

source: སྐད་ཅིག་འགུགས་པར་བྱེད་བསྟེན་པའི། །འབྱུང་པོ་ཐམས་ཅད་ཞི་ཕྱིར་དང་། །
en: It is said that they should be summoned For the pacification of all beings. {12.14}

source: ལྷ་དང་ལྷ་མིན་དྲི་ཟ་དང་། །མི་འམ་ཅི་དང་སྲིན་པོ་རྣམས། །དབང་དུ་བྱ་བའི་ལས་བྱེད་དེའབྱུང་པོ་ཀུན་ཡང་རྒྱས་པར་བྱེད། །
en: “The gods, asuras, gandharvas, Kinnaras, and rākṣasas, on the other hand, Can be summoned in a properly performed rite In order to provide nourishment to all beings. {12.15}

source: དོན་ཡོད་ལས་ནི་བྱེད་པ་སྟེ། །ལས་རྣམས་སྣ་ཚོགས་མ་ལུས་བྱེད། །
en: “One will make all the rites That are done on earth bear fruit.

source: ཤར་ཕྱོགས་ཡལ་ག་ལས་སྐྱེས་ཤིང་། །ཡང་དག་འབྱུང་བའི་འབྲས་བུ་ནི། །
en: If the seeds originate from a branch That is in the eastern quarter, {12.16}

source: དེ་ཚེ་འབད་དེ་བྱས་གྱུར་ན། །ཚེ་ནི་རིང་བའི་རྒྱུ་ཡང་ཡིན། །
en: “One should always employ them zealously As causes for bringing long life.

source: རྟག་ཏུ་སྔགས་གྲུབ་འབྲས་བུ་ནི། །རྣམ་པ་སྣ་ཚོགས་བྱེད་པ་ཡིན། །
en: Thus, one will always obtain a different mantra-accomplishment Depending on the type of seeds. {12.17}

source: གང་ཞིག་ལྷོར་ནི་འགྲོ་བ་ཡི། །ཡལ་ག་ལོ་མར་རབ་ལྡན་པའི། །སྔགས་པས་དེ་ནི་འབད་དེ་སྤང་། །
en: “If a branch extends in the southern direction And abounds in leaves, A mantra reciter should carefully avoid it,

source: སེམས་ཅན་རྣམས་ཀྱི་སྲོག་འཕྲོག་བྱེད། །
en: For the seeds from it will drain the vital force from living beings. {12.18}

source: ལྷོར་བརྟེན་པ་ཡི་ཡལ་ག་དང་། །འབྲས་བུ་གང་དག་སྐྱེས་པ་ནི། །བླངས་ན་གདུང་བྱེད་དགྲ་རྣམས་ཀྱི། །སྲོག་ནི་འཇིག་པར་བྱེད་པ་ཡིན། །
en: “If one recites using the seeds That are growing On branches extending south, One will destroy the life force of one’s enemies. {12.19}

source: ཟློས་པས་འབད་དེ་སྤང་བར་བྱ། །བསོད་ནམས་མ་ཡིན་མང་པོའི་རྒྱུ། །
en: “One should carefully avoid such acts, though, For they are the cause of a great deal of negativity.

source: ཡལ་ག་འོག་ཏུ་འཕྱང་གནས་ལ། །འབྲས་བུ་གང་ཞིག་རབ་བསྒྲགས་པ། །ལྷ་མིན་བུ་མོ་གནས་པ་ཡི། །ས་ཡི་འོག་ཏུ་འགྲོ་བར་འགྱུར། །དེ་ཡི་འབྲས་བུའི་ཕྲེང་བ་ནི། །
en: Seeds that are described as hanging Underneath the lower branches {12.20} “Will enable one to reach Rasātala, The place where dānava women live, If one takes along a rosary made of them.

source: བླངས་ནས་འོག་ཏུ་འགྲོ་བརྟེན་པ། །ས་ཡི་འོག་ཏུ་གནས་པར་ནི། །དེས་ན་དེ་ནི་འགྲོ་བར་བྱེད། །
en: So have these seeds been described. {12.21} “Seeds that cling to the lower branches Will enable one to reach Pātāla.

source: དེར་ཞུགས་ལྷ་ཡི་བདེ་བ་ནི། །ཟློས་པས་ཐོབ་པར་འགྱུར་བ་ཡིན། །
en: Once he has entered there, Divine pleasures await a mantra reciter. {12.22}

source: ལྷ་མིན་བུ་མོ་ཆགས་བཞིན་དུ། །བསྐལ་པར་དེ་ནི་གནས་པར་བྱེད། །
en: “He will remain united with asura women And stay there for an eon.

source: མེ་ཏོག་ཕྲེང་བ་ཀུན་བླངས་ནས། །དེ་ནས་ཟློས་པ་སླར་ལོག་བྱ། །
en: A reciter will be able to descend there If he takes with him a complete set of such seeds. {12.23}

source: གྲོགས་དང་ལྷན་ཅིག་བསྲུང་བྱས་ནས། །དེ་ནས་ཇི་ལྟར་བདེ་བར་འགྲོ། །
en: “One should perform a protection rite And travel, with companions, to a place of one’s choice.

source: གནས་ནས་ཐག་རིང་སོང་ནས་ནི། །དེ་བཞིན་གཙང་ཕྱོགས་ཆོ་ག་བཞིན། །
en: Having thus traveled to a distant place, Which always must be clean, {12.24}

source: དེ་ནས་སྔགས་པས་རྟག་ཏུ་འདུག །
en: “A mantra practitioner should stay there.

source: ཕྲེང་བ་ཡོངས་སུ་སྦྱང་བར་བྱ། །བརྩོན་པས་ཕྲེང་བའི་འབྲས་བླངས་ཏེ། །
en: He should purify the set of seeds, Taking each of the seed-beads

source: ཀུན་ནས་ཡོངས་སུ་དག་བྱས་ནས། །སྔགས་པ་བཟང་པོས་ཕྲེང་བ་དབུག །
en: And cleaning it thoroughly all over. {12.25} “Having cleaned them completely, The mantra adept should drill holes in them.

source: གསུམ་བདུན་བརྒྱད་དང་གཅིག་གམ་ནི། །ཉི་ཤུ་དང་ནི་རྩ་གཅིག་ཏུ། །
en: Repeating the mantra three, seven, eight, One, or twenty-one times, {12.26}

source: སྔགས་ཀྱི་དེ་ཉིད་ཤེས་པས་བཀྲུ། །
en: “One who knows the nature of mantra should purify the beads.

source: སྔ་མའི་སྔགས་ཀྱིས་རྟག་ཏུ་ཡང་། །བདུན་ནམ་བརྒྱད་དུ་བཟླས་པར་བྱ། །དེ་ནས་དག་པར་ཡང་དག་འདོད། །
en: Always using the same mantra as before, Repeated either seven or eight times, The purification will be ensured. {12.27}

source: པདྨའི་རྩ་ལག་དག་ལས་ནི། །བུ་མོས་བཀལ་བའི་སྐུད་པ་དག །
en: “Such a lay vow holder should prepare twine Using thread spun by a virgin

source: གསུམ་དང་ལྔ་ལྡབ་བྱས་པ་ཡི། །སྡོམ་ཅན་གྱིས་ནི་ཕྲེང་སྐུད་བྱ། །
en: Joined with five threefold strains Of fibers from a lotus stalk. {12.28}

source: སྔགས་ཀྱི་དེ་ཉིད་ཤེས་པས་བརྒྱུ། །འབྲུ་ནི་ཕྲ་ཞིང་ཤིན་ཏུ་ཟླུམ། །རྟག་ཏུ་སྲོག་ཆགས་བུ་ག་མེད། །
en: “One who knows the nature of mantra should string upon it Seeds that are fine, well rounded, Never damaged by worms,

source: ལེགས་འཇམ་སྨད་པའང་མེད་པ་ཡིན། །
en: And without protrusions or other imperfections. {12.29}

source: མཛེས་དང་ཁ་དོག་མཛེས་པ་དང་། །དེ་བཞིན་གས་མེད་བུ་ག་མེད། །
en: “They must be beautiful and of nice color, Without holes or cracks,

source: རུ་དྲཱཀྵ་དང་བོ་དེ་ཙེ། །ཨིན་དྲཱཀྵ་ཡི་འབྲས་བུ་ཉིད། །རྟག་ཏུ་ལུང་ཏང་མཛེས་པ་དང་། །གཞན་ཡང་འབྲས་བུ་འདོད་པ་དག །འབད་པ་ཡིས་ནི་ཕྲེང་བ་དག །སྔགས་པས་བརྩོན་བྱས་དེ་ཚེ་བརྒྱུ། །
en: And may be either from the rudrākṣa tree, Lucky bean tree, or arjuna tree. {12.30} “Applying himself to the task with care, A mantra practitioner should string a rosary of beads That is ever unspoiled, beautiful, Not deformed, and composed of identical beads. {12.31}

source: གསེར་རམ་ཡང་ན་དངུལ་དག་གམ། །ནོར་བུ་ཤེལ་ལས་བྱས་པ་དང་། །དུང་དང་མུ་ས་ར་དག་དང་། །མུ་ཏིག་ལས་ཀྱང་བྱ་བ་ཡིན། །
en: “Alternatively, the beads Could be made of gold, silver, Rubies, crystal, Conch, musāragalva coral, or pearl. {12.32}

source: བྱི་རུ་རྣམ་པ་སྣ་ཚོགས་ཀྱི། །ཕྲེང་བ་དག་ཀྱང་བྱ་བ་ཡིན། །གཞན་ཡང་རིན་ཆེན་བཟང་པོ་ཡི། །ཕྲེང་བ་ལེགས་པར་རབ་ཏུ་བྱ། །
en: “One can make different types of rosaries, Using coral or other precious substances, To create a divine rosary, Beautiful and auspicious. {12.33}

source: ས་ནི་རབ་བཟླུམས་རིལ་བུ་དག །མཉམ་པར་བཞག་ནས་སྐུད་པས་བརྒྱུ། །གཞན་ཡང་རིལ་བུ་ཅུང་ཟད་གང་། །འབྲས་བུ་འབྱུང་ཁུང་དག་ལས་བྱ། །
en: “With a focused mind, one should string onto the thread Round beads made of earth, Or any other beads that are more or less round, Be they seeds or mineral in origin. {12.34}

source: ཀུ་ཤའི་རྩེ་མོའི་མདུད་པས་ཀྱང་། །སྔགས་པས་འབད་དེ་བྱ་བ་ཡིན། །
en: “Reciting the mantra with earnestness, One should string the beads using a sharp-pointed blade of grass,

source: བརྒྱ་རྩ་བརྒྱད་དམ་ཉི་ཤུ་འམ། །ལྔ་བཅུ་ཉིད་ནི་བར་མ་ཡིན། །
en: Either one hundred and eight of them, or twenty-five, Or the medium number of fifty. {12.35}

source: སྔགས་པ་མཉམ་པར་བཞག་ནས་ནི། །ཚད་འདིས་ཕྲེང་བ་བརྒྱུ་བ་ཡིན། །
en: “A rosary of this size should be strung By a well-focused mantra practitioner.

source: རྩ་བརྒྱད་སྟོང་དུ་བྱ་བ་ནི། །ཕྲེང་བའི་མཆོག་ཏུ་བྱ་བ་ཡིན། །
en: The supreme kind of rosary Would consist of one thousand and eight beads. {12.36}

source: ཕྲེང་བའི་རྣམ་པ་འདི་བཞི་ཡང་། །སྔགས་པས་རྟག་ཏུ་བརྒྱུ་བ་ཡིན། །
en: “It is always a rosary of one of these four types That may be strung by the practitioners of mantra.

source: དེ་ལྟར་བརྒྱུ་བ་བྱས་ནས་ནི། །རིམ་པ་གསུམ་མམ་གཉིས་སུ་བྱ། །
en: When subsequently tying the knot, One should do it thrice, or at least twice. {12.37}

source: ལྕགས་བཟང་རང་བཞིན་གདུ་བུར་བྱ། །དེ་བཞིན་གསེར་དངུལ་དག་དང་ནི། །དེ་བཞིན་ཟངས་མའི་གདུ་བུ་ཡིས། །ཕྲེང་བ་ཀུན་ཡང་བཅིང་བར་བྱ། །
en: “To keep the rosary tight ( mālāsamāsataḥ ), One should fasten [the knot] With rings made of flower-metal, gold, Silver, or copper. {12.38}

source: དེ་ནས་ཡང་མིག་ཀུན་མཐར་ནི། །ཀུན་ལའང་དེ་བཞིན་གདགས་པར་བྱ། །
en: “Finally, one should make a plaiting loop, Adding them in succession to form a plait.

source: འབད་པས་དམ་དུ་བཅིང་བྱ་སྟེ། །ཇི་ལྟར་དམ་པོར་འགྱུར་བར་རོ། །
en: One should wrap the plait firmly and with care, So that it stays tight. {12.39}

source: ཡོངས་སུ་གསལ་བར་བྱས་ནས་ནི། །དཀྱིལ་འཁོར་ལྟ་བུར་མཐོང་བ་ཡིན། །
en: “One should fashion it well To make it resemble a maṇḍala

source: དེ་ལྟར་སྦྲུལ་གྱི་གདེངས་ཀ་ལྟར། །ཡོངས་སུ་འཁོར་བས་བརྒྱན་པ་ཡིན། །
en: With the shape of a snake’s hood Adorned by the wrapping. {12.40}

source: མུ་ཏིག་ཕྲེང་བ་འདྲ་བ་ཡིས། །མགུལ་བར་བརྒྱན་པ་ལྟ་བུར་བྱ། །
en: “The rosary may have the form of a string of pearls, Fashioned as a neck ornament.

source: ཆུ་བོ་དག་ནི་དྲི་མེད་པའི། །ཆུ་གཙང་དག་གིས་ཁྲུས་བྱ་ཞིང་། །
en: One should wash it in pure water, Such as that of a clean river. {12.41}

source: ཇི་ལྟར་གོ་རིམས་ཁྲུས་བྱས་ནས། །
en: “Having washed it as described before,

source: ཆུ་བཞི་ལས་ནི་ལྡང་ནས་སུ། །འབད་པས་དེ་བཞིན་ཉེ་རེག་བྱ། །
en: One should take it out of the water And perform the ablutions thoroughly oneself ,

source: ཕྲེང་བ་རྗེས་སུ་བླངས་ནས་ནི། །བ་ཡི་རྣམ་ལྔས་རབ་ཏུ་བཀྲུ། །
en: Holding it as one does a string of beads. {12.42} “One should wipe it with the five products of the cow

source: དེ་བཞིན་ས་ཡི་ཕྱེ་མ་དང་། །
en: And, likewise, with powdered clay.

source: ཆུ་གཙང་དག་གིས་རབ་བཀྲུས་ཏེ། །དྲི་ཞིམ་དག་གིས་རྗེས་བྱུགས་ཤིང་། །
en: One should then rinse it with clean water And smear it with fragrant unguents, {12.43}

source: རབ་ཏུ་བསྔགས་པའི་ཁ་དོག་ཀྱང་། །ཙནྡན་དཀར་དང་གུར་གུམ་མོ། །
en: “Including those of auspicious colors, Such as white sandalwood and saffron.

source: དེ་ནས་དེ་བཞིན་གཉི་ག་འགྲོ། །འབད་པ་ཡིས་ནི་རབ་ཏུ་བཀྲུ། །
en: Having thus anointed it with care, One should go to one’s hut. {12.44}

source: དེ་བཞིན་ཁྲུས་བྱས་སོང་ནས་ནི། །གང་ན་རས་རིས་བར་མ་དེ། །
en: “One should walk up to the place Where the painting of the medium type is,

source: རྒྱལ་བ་གཙོ་བོ་ཐུབ་མཆོག་ནི། །ཤཱཀྱ་སེང་གེ་མི་ཡི་མཆོག །
en: With the supreme among the victorious ones, the chief sage, The best of men, the Lion of the Śākyas, painted in its center. {12.45}

source: དེ་བཞིན་རྟག་ཏུ་སྟོན་པའི་གཟུགས། །ས་སྟེང་རྒྱལ་བའི་རིང་བསྲེལ་ཅན། །དེ་ཡི་མདུན་དུ་ཕྲེང་བ་ནི། །དེ་དང་ཉེ་བར་གཞག་པར་བྱ། །
en: “One should always place the rosary Before the image of the Teacher that contains relics Of the victorious upon the earth; It should be placed close by. {12.46}

source: དེ་དང་ཉེ་བར་བཞག་ནས་ནི། །དེ་ཡི་མདུན་དུ་ཉེར་གནས་ནས། །
en: “One should thus place the rosary on the canvas Before and near to the image of Śākyamuni

source: སྟོང་ཕྲག་གཅིག་དང་བརྒྱད་དང་ནི། །བརྒྱ་དང་རྩ་བརྒྱད་བཟླས་ནས་ཀྱང་། །
en: And incant it 1000 times 108, Plus an additional 108 times. {12.47}

source: ཉིན་ཞག་གཅིག་ནི་སྨྱུང་བྱས་ཏེ། །བདུན་པ་ཐུབ་ལ་ཕྲེང་བ་དབུལ། །
en: “Having fasted the whole day and night, One should offer the rosary to the best of sages.

source: སྔ་མ་དེ་བཞིན་བཟླས་བྱས་ནས། །ཚད་ཀྱང་དེ་དང་མཉམ་པར་བྱ། །
en: One can also do the recitation as before, Identical in terms of numbers. {12.48}

source: དེ་ནས་ཕྲེང་བ་ལ་བཟླས་ནས། །དེ་ཡི་མཚན་མོ་ཉལ་བར་བྱ། །
en: “Then, having incanted the rosary, One should leave it there for the night.

source: ཀུ་ཤ་བཏིང་བའི་ས་ལ་ནི། །སྔགས་ཤེས་དེར་ནི་ཉལ་བར་བྱ། །
en: A knower of mantras should sleep in the same place, On a bed of kuśa grass spread on the ground. {12.49}

source: གལ་ཏེ་དེས་ནི་རྨི་ལམ་ན། །དགེ་བའི་རྨི་ལམ་མཐོང་ན་ནི། །འབྲས་བཅས་རྨི་ལམ་སྟོན་པ་སྟེ། །དེ་ལ་གྲུབ་པར་བསྟན་པ་ཡིན། །
en: “Should he behold in his sleep Beautiful dream images, They indicate the results In which he will obtain accomplishment. {12.50}

source: སངས་རྒྱས་ཉན་ཐོས་བསེ་རུ་ནི། །གལ་ཏེ་འདི་ཡིས་རྨི་ལམ་མཐོང་། །སྔགས་པ་དེ་ཡི་བྱ་བ་ནི། །འབྲས་བཅས་ངེས་པར་འགྲུབ་པར་འགྱུར། །
en: “If a practitioner of mantra should see in his dream Buddhas, śrāvakas, or pratyeka­buddhas, His ritual actions will definitely succeed, Bearing results for him. {12.51}

source: གཞོན་ནུའི་གཟུགས་ཅན་བྱིས་པ་ནི། །རྣམ་པ་སྣ་ཚོགས་མཛེས་མཐོང་བ། །གལ་ཏེ་རྨི་ལམ་ངེས་མཐོང་དང་། །ཕྲེང་བ་སྩོལ་བའང་དེ་བཞིན་ཏེ། །
en: “If he beholds in his sleep A wonderful, beautiful-looking boy In the form of the divine youth, He should offer the rosary to him.

source: དོན་ཡོད་དེ་ནི་འགྲུབ་འགྱུར་ཏེ། །སྔགས་ཀྱི་དོན་རྣམས་སྒྲུབ་བྱེད་པའོ། །
en: His mantras will succeed without fail, Accomplishing all his aims.” {12.52}

source: བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཐེག་པ་ཆེན་པོ་ཤིན་ཏུ་རྒྱས་པའི་མདོ་ལས། འཕགས་པ་འཇམ་དཔལ་གྱི་རྩ་བའི་ཆོ་ག་ལས་རས་རིས་བར་མ་ལ་བརྟེན་པ་ཆོ་ག་རབ་འབྱམ་ལས། ཕྲེང་བའི་ཆོ་ག་རབ་འབྱམ་བཅུ་གཉིས་པ་རྫོགས་སོ།། །།
en: This concludes the detailed twelfth chapter in “The Root Manual of Noble Mañjuśrī,” an extensive Mahāyāna sūtra that forms a garland-like basket of bodhisattva teachings. This chapter belongs to the detailed section on the procedure of the “medium” painting, and also constitutes the detailed chapter on the procedure of the rosary.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པས། གཞན་ཡང་ཐམས་ཅད་དང་ལྡན་པའི་གནས་གཙང་མའི་གཞལ་མེད་ཁང་ལ་གཟིགས་ནས། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ།
en: Now Lord Śākyamuni again looked at the realm of the Pure Abode, and said this to Mañjuśrī, the divine youth:

source: འཇམ་དཔལ་ཁྱོད་ཀྱི་སྔགས་མཐའ་དག་རྣམ་པར་དགོད་པའི་ཁྱད་པར་གྱི་ཆོ་ག་དང་སྦྱིན་སྲེག་གི་ལས་ལ་རབ་ཏུ་སྦྱོར་བའི་རིག་པ་སྒྲུབ་པ་ཡོད་དེམེ་ལ་ཉེ་བར་སྤྱོད་པའི་ཁྱད་པར་གྱི་ཆོ་གའི་ཕྱིར།
en: “There is, O Mañjuśrī, a ritual sequence for a special worship of [the god of] fire, which is meant for those practitioners of vidyā who engage in the rite of homa according to the special procedure that has been succinctly explained in the chapter on mantras in your manual.

source: གང་གི་རིག་པ་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ལ་མངོན་པར་བརྩོན་པའི་སེམས་ཅན་རབ་ཏུ་འཇུག་ཅིང་གནས་པར་འགྱུར་རོ། །
en: Once established in this routine, beings become actively engage in the conduct of all vidyā s.

source: གསང་བའི་རིག་སྔགས་ཀྱི་གཞི་ནི་འདི་ལྟ་སྟེ།
en: The mantric words of the secret vidyā spell are as follows: {13.1}
